S1Сtest/src/Catalogs/ГосУслуги/ГосУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГосУслуги</name>
  <attributes>
    <name>Ведомство</name>
    <type>
      <types>CatalogRef.Ведомства</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаМаршрута</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииГосУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатнаяУслуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПошлины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>ВидЭтапа</name>
      <type>
        <types>EnumRef.ВидыЭтаповПредоставленияГосУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Ведомство</name>
      <type>
        <types>CatalogRef.Ведомства</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийЭтапУспех</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СледующийЭтапНеудача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииПолучателей</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>EnumRef.КатегорияПолучателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляЗаявления</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидПоляЗаявления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

S1Сtest/src/Catalogs/ГосУслуги/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		// Показываем карту бизнес-процесса
		
		ОбновитьКартуМаршрута();
		
	КонецЕсли;
	
	ПоказатьСкрытьРазмерПошлины();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	КартаМаршрута = ОбъектНаСервере.КартаМаршрута.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатнаяУслугаПриИзменении(Элемент)
	
	ПоказатьСкрытьРазмерПошлины();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьРазмерПошлины()
	
	Элементы.РазмерПошлины.Видимость = Объект.ПлатнаяУслуга;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем карту бизнес-процесса
	ТекущийОбъект.КартаМаршрута = Новый ХранилищеЗначения(КартаМаршрута, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьКартуМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьГосУслуги", Объект.Ссылка);
	
КонецПроцедуры
